/* (unsaved) */
"(unsaved)" = "(tallentamaton)";

/* A newer version (%@) is available. Do you want to download it? in checkForUpdate */
"A newer version (%@) is available. Do you want to download it?" = "Uudempi versio (%@) on saatavilla. Haluatko ladata sen?";

/* Advanced preferences toolbar item Label */
"Advanced" = "Edistyneet";

/* Advanced Find */
"Advanced Find" = "Edistynyt haku";

/* The name for the all documents project */
"All documents" = "Kaikki asiakirjat";

/* Appearance preferences toolbar item Label */
"Appearance" = "Ulkoasu";

/* Ask if you are sure that you want to delete %i occurrences of %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to delete %i occurrences of %@?" = "Oletko varma, että haluat poistaa %1$i esiintymää merkkijonosta “%2$@”?";

/* Ask if you are sure that you want to delete the one occurrence of %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to delete the one occurrence of %@?" = "Oletko varma, että haluat poistaa yhden esiintymän merkkijonosta “%@?”";

/* Ask if you are sure that you want to replace %i occurrences of %@ with %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to replace %i occurrences of %@ with %@?" = "Oletko varma, että haluat korvata %1$i esiintymää merkkijonosta “%2$@” merkkijonolla “%3$@”?";

/* Ask if you are sure that you want to replace one occurrence of %@ with %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to replace one occurrence of %@ with %@?" = "Oletko varma, että haluat korvata yhden esiintymän merkkijonosta “%1$@” merkkijonolla “%2$@”?";

/* Ask if you are sure you want to download preferences for Smultron from your iDisk and replace your current settings in Download-preferences-from-iDisk sheet */
"Are you sure you want to download preferences for Smultron from your iDisk and replace your current settings?" = "Oletko varma, että haluat ladata Smultronin asetukset iDisk:ltäsi ja korvata nykyiset asetukset?";

/* Ask if they are sure they want to install the command-line utility in Install-command-line-utility sheet */
"Are you sure you want to install the command-line utility?" = "Oletko varma, että haluat asentaa komentorivi-työkalun?";

/* Ask if you are sure you want to revert this document in Revert-sheet */
"Are you sure you want to revert this document?" = "Oletko varma, että haluat palauttaa tämän asiakirjan?";

/* Ask if you are sure you want to upload your current preferences for Smultron and replace the preference file on your iDisk (if it exists) in Upload-preferences-to-iDisk sheet */
"Are you sure you want to upload your current preferences for Smultron and replace the preference file on your iDisk (if it exists)?" = "Oletko varma, että haluat siirtää tämän hetkiset Smultron-asetuksesi ja korvata asetustiedoston iDisk:lläsi (jos se on olemassa)?";

/* Authenticate */
"Authenticate" = "Autentikoi";

/* The name for bytes in the info window */
"bytes" = "tavua";

/* Cancel-button */
"Cancel" = "Kumoa";

/* Name for undo Change Encoding */
"Change Encoding" = "Vaihda koodaus";

/* Name for undo Change Line Endings */
"Change Line Endings" = "Vaihda rivin lopetukset";

/* Indicate that they should change the preferences to a different encoding or be careful to check the content if you choose to open it in Check-encoding sheet */
"Change the preferences to a different encoding or be careful to check the content if you choose to open it" = "Muuta asetukset toiseen koodaukseen tai tarkista sisältö huolellisesti, jos päätät avata sen";

/* Indicate that they should choose something that is not a folder or change the settings in Preferences so that all items in a folder are opened in Open-file-is-a-directory sheet */
"Choose something that is not a folder or change the settings in Preferences so that all items in a folder are opened" = "Valitse jotain, joka ei ole kansio tai muuta valintoja Asetuksista niin, että kaikki tiedostot kansiosta avataan";

/* Close */
"Close" = "Sulje";

/* Close Split */
"Close Split" = "Sulje jako";

/* Collection */
"Collection" = "Kokoelma";

/* Commands */
"Commands" = "Komennot";

/* The word to indicate that the filename is a copy in Save-A-Copy-As save-panel */
"copy" = "kopioi";

/* Could not find a match for search-string %@ in Advanced Find */
"Could not find a match for search-string %@" = "Ei voitu löytää haettua merkkijonoa “%@”";

/* Indicate that the program could not find the syntax file to match this document in Could-not-find-syntax-file sheet */
"Could not find the syntax file to match this document" = "Ei löydetty syntaksitiedostoa, joka vastaisi tätä asiakirjaa";

/* Indicate that the program could not overwrite the file %@ because it has been removed in File-has-been-removed sheet */
"Could not overwrite the file %@ because it has been removed" = "Ei voitu päällekirjoittaa tiedostoa %@ , koska se on poistettu";

/* Delete-button */
"Delete" = "Poista";

/* Ask whether they want to ignore the updates the other application has made or reload the document and destroy any changes you have made to this document Document-has-been-updated-alert sheet */
"Do you want to ignore the updates the other application has made or reload the document and destroy any changes you have made to this document?" = "Haluatko jättää huomiotta toisen sovelluksen tekemät muutokset, tai ladata asiakirjan uudelleen ja tuhota kaikki muutokset, jotka olet tehnyt tähän asiakirjaan?";

/* Ask whether they want to ignore the updates the other application has made or reload the document Document-has-been-updated-alert sheet */
"Do you want to ignore the updates the other application has made or reload the document?" = "Haluatko jättää huomiotta toisen sovelluksen tekemät muutokset, tai ladata asiakirjan uudelleen?";

/* Ask if you want to open %@ as a project or as a text file in Ask-if-project-or-file sheet */
"Do you want to open %@ as a project or as a text file" = "Haluatko avata kohteen %@ projektina vai tekstitiedostona";

/* Don't Line Wrap Text */
"Don't Line Wrap Text" = "Älä kääri rivejä";

/* Don't Save-button in Close-sheet */
"Don't Save" = "Älä tallenna";

/* Download */
"Download" = "Lataa";

/* Encoding, in the status bar */
"Encoding" = "Koodaus";

/* Found %i matches for search-string %@ in Advanced Find */
"Found %i matches for search-string %@" = "Löydettiin %1$i vastausta haetulle merkkijonolle “%2$@”";

/* Found one match for search-string %@ in Advanced Find */
"Found one match for search-string %@" = "Löydettiin yksi vastaus haetulle merkkijonolle “%@”";

/* Function */
"Function" = "Funktio";

/* General preferences toolbar item Label */
"General" = "Yleiset";

/* Hide Documents List in View menu */
"Hide Documents List" = "Kätke tiedostolista";

/* Hide Invisible Characters in View-menu */
"Hide Invisible Characters" = "Kätke näkymättömät merkit";

/* Hide Line Numbers */
"Hide Line Numbers" = "Kätke rivinumerot";

/* Hide Projects toolbar item Label */
"Hide Projects" = "Kätke projektit";

/* Hide Projects Drawer in View menu */
"Hide Projects Drawer" = "Kätke projektit-vetolaatikko";

/* Hide Status Bar in View-menu */
"Hide Status Bar" = "Kätke tilarivi";

/* Hide Syntax Colours */
"Hide Syntax Colours" = "Kätke syntaksivärjäys";

/* Hide Tab Bar in View menu */
"Hide Tab Bar" = "Kätke välilehdet";

/* Indicate that if you choose Install smultron will be installed in /usr/bin and its man page in /usr/share/man/man1 and you can use it directly in the Terminal (you may need to authenticate twice with an administrators username and password). Otherwise you can choose to place all the files you need on the desktop and install it manually. in Install-command-line-utility sheet */
"If you choose Install smultron will be installed in /usr/bin and its man page in /usr/share/man/man1 and you can use it directly in the Terminal (you may need to authenticate twice with an administrators username and password). Otherwise you can choose to place all the files you need on the Desktop and install it manually." = "Jos valitset Asenna, Smultron asennetaan hakemistoon /usr/bin and sen man-sivu hakemistoon /usr/share/man/man1, voit käyttää sitä Pääte-sovelluksessa (saatat joutua autentikoimaan kahdesti pääkäyttäjän käyttäjätunnuksella ja salasanalla). Muussa tapauksessa voit sijoittaa tiedostot Työpöydälle ja asentaa ne käsin.";

/* Indicate that if you want you can try to authenticate with an administrators username and password */
"If you want you can try to authenticate with an administrators username and password" = "Jos haluat, voit autentikoida pääkäyttäjän käyttäjätunnuksella ja salasanalla";

/* Ignore-button in Document-has-been-updated-alert sheet */
"Ignore" = "Jätä huomiotta";

/* The name for the collection that holds the snippets that are imported from version 1 */
"Imported Snippets" = "Tuodut pätkät";

/* Info */
"Info" = "Info";

/* Install-button in Install-command-line-utility sheet */
"Install" = "Asenna";

/* Indicate that it seems as if you do not have permission to open the file %@ in Not-enough-permission-to-open sheet */
"It seems as if you do not have permission to open the file %@" = "Sinulla ei ole oikeutta avata tiedostoa “%@”";

/* Indicate that it seems as if you do not have permission to save the file %@ in Not-enough-permission-in-data-save sheet */
"It seems as if you do not have permission to save the file %@" = "Sinulla ei ole oikeutta tallentaa tiedostoa “%@”";

/* Saved, in the status bar */
"Saved" = "Tallennettu";

/* Length, in the status bar */
"Length" = "Pituus";

/* Line Wrap Text */
"Line Wrap Text" = "Kääri rivit";

/* Line Wrap / Don't Line Wrap toolbar item Palette Label */
"Line Wrap / Don't Line Wrap" = "Kääri rivit / Älä kääri rivejä";

/* Live Find */
"Live Find" = "Etsi lennossa";

/* New */
"New" = "Uusi";

/* Indicate that no document is selected for the dummy view */
"No document selected" = "Yhtään asiakirjaa ei ole valittuna";

/* Not applicable in insertAllFunctionsIntoMenu */
"Not applicable" = "Ei käyttökelpoinen";

/* OK-button */
"OK" = "OK";

/* The name for the collection that holds the old snippets that are imported from version 1 */
"Old Snippets" = "Vanhat pätkät";

/* Open */
"Open" = "Avaa";

/* OpenSave preferences toolbar item Label */
"Open & Save" = "Avaa & Tallenna";

/* Please be patient. It could take a while. in preparing to print */
"Please be patient. It could take a while." = "Ole kärsivällinen. Tämä saattaa kestää hetken aikaa.";

/* Indicate that they should please change the preferences if you want any information in the bar in Show-status-bar-action */
"Please change the preferences if you want any information in the bar" = "Muuta asetuksia, jos haluat nähdä tietoa rivillä";

/* Indicate that they should please check if you've moved or deleted the original file in Revert-file-doesn't-exist sheet */
"Please check if you've moved or deleted the original file" = "Tarkista onko alkuperäinen tiedosto siirretty tai poistettu";

/* Indicate that they should Please check the installation of the application and the preferences in Could-not-find-syntax-file sheet */
"Please check the installation of the application and the preferences" = "Tarkista ohjelman asennus ja asetuksesi";

/* Indicate that they should please check the permissions for the file and the enclosing folder and try again in Unknown-error-when-opening-with-authentication sheet */
"Please check the permissions for the file and the enclosing folder and try again" = "Tarkista tiedoston ja sen sisältävän kansion oikeudet, ja yritä uudelleen";

/* Please consider exporting the snippets first. There is no undo available. when deleting a collection */
"Please consider exporting the snippets first. There is no undo available." = "Harkitse pätkien viemistä ensin. Peruminen ei ole mahdollista.";

/* Indicate that they should find it at different location by choosing Open%C in the File menu Open-file-does-not-exist sheet */
"Please find it at a different location by choosing Open%C in the File menu" = "Valitse toinen sijainti valitsemalla Avaa%C Tiedosto-valikosta";

/* Indicate that they should try to save in a different location */
"Please save it at a different location" = "Tallenna toiseen sijaintiin";

/* Indicate that they should try to save at a different location with Save As%C in File menu in Path-is-a-directory sheet */
"Please save it at a different location with Save As%C in the File menu" = "Tallenna toiseen sijaintiin Tallenna nimellä%C toiminnolla Tiedosto-valikosta";

/* Indicate that you should try a different location with Save As%C in the File menu in Unknown-error-when-saving-with-authentication sheet */
"Please try a different location with Save As%C in the File menu" = "Yritä toista sijaintia Tallenna nimellä%C toiminnolla Tiedosto-valikosta";

/* Indicate that you should try a different location with Save As%C in the File menu or check the permissions of the file and the enclosing folder and try again in Unknown-error-when-saving sheet */
"Please try a different location with Save As%C in the File menu or check the permissions of the file and the enclosing folder and try again" = "Yritä toista sijaintia Tallenna nimellä%C toiminnolla Tiedosto-valikosta, tai tarkista tiedoston ja sen sisältävän kansion oikeudet, ja yritä uudelleen";

/* Indicate that they should try to save in a different location with in Unknown-error-when-data-saving sheet */
"Please try to save in a different location" = "Tallenna toiseen sijaintiin";

/* Indicate that they should please use Save As%C in the File menu in File-has-been-removed sheet */
"Please use Save As%C in the File menu" = "Käytä Tallenna nimellä%C toimintoa Tiedosto-valikosta";

/* Position, in the status bar */
"Position" = "Sijainti";

/* Preferences */
"Preferences" = "Asetukset";

/* Preparing the document for printing in preparing to print */
"Preparing the document for printing" = "Valmistellaan asiakirjaa tulostusta varten";

/* Press the Escape-button on the keyboard to return from the full screen mode in Show Document In Full Screen */
"Press the Escape-button on the keyboard to return from the full screen mode" = "Paina Esc-nappia näppäimistöstä poistuaksesi koko näytön tilasta";

/* Preview */
"Preview" = "Esikatselu";

/* Project-button in Ask-if-project-or-file sheet */
"Project" = "Projekti";

/* Put On Desktop-button in Install-command-line-utility sheet */
"Put On Desktop" = "Laita työpöydälle";

/* Reload-button in Document-has-been-updated-alert sheet */
"Reload" = "Lataa uudelleen";

/* Remember that you can always Undo any changes in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Remember that you can always Undo any changes" = "Muista että voit aina perua kaikki muutokset";

/* Replace-button in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Replace" = "Korvaa";

/* Indicate that we replaced %i occurrences of %@ with %@ in update-search-textField-after-replace */
"Replaced %i occurrences of %@ with %@" = "Korvattiin %1$i esiintymää merkkijonosta “%2$@” merkkijonolla “%3$@”";

/* Indicate that we replaced one occurrence of %@ with %@ in update-search-textField-after-replace */
"Replaced one occurrence of %@ with %@" = "Korvattiin yksi esiintymä merkkijonosta “%1$@” merkkijonolla “%2$@”";

/* Revert-button in Revert-sheet */
"Revert" = "Palauta";

/* Save */
"Save" = "Tallenna";

/* Selection, in the status bar */
"Selection" = "Valinta";

/* Show Documents List in View menu */
"Show Documents List" = "Näytä tiedostolista";

/* Show Invisible Characters in View-menu */
"Show Invisible Characters" = "Näytä näkymättömät merkit";

/* Show Line Numbers */
"Show Line Numbers" = "Näytä rivinumerot";

/* Show Projects toolbar item Label */
"Show Projects" = "Näytä Projektit";

/* Show Projects Drawer in View menu */
"Show Projects Drawer" = "Näytä Projektit-vetolaatikko";

/* Show Status Bar in View-menu */
"Show Status Bar" = "Näytä tilarivi";

/* Show Syntax Colours */
"Show Syntax Colours" = "Näytä syntaksivärjäys";

/* Show Tab Bar in View menu */
"Show Tab Bar" = "Näytä välilehdet";

/* Show/Hide Line Numbers toolbar item Palette Label */
"Show/Hide Line Numbers" = "Näytä/Kätke rivinumerot";

/* Show/Hide Projects toolbar item Palette Label */
"Show/Hide Projects" = "Näytä/Kätke projektit";

/* Show/Hide Syntax Colours toolbar item Palette Label */
"Show/Hide Syntax Colours" = "Näytä/Kätke projektit";

/* Snippets */
"Snippets" = "Pätkät";

/* Split Window */
"Split Window" = "Jaa ikkuna";

/* Split Window / Close Split toolbar item Palette Label */
"Split Window / Close Split" = "Jaa ikkuna / Sulje ikkunan jako";

/* Syntax, in the status bar */
"Syntax" = "Syntaksi";

/* Syntax colours preferences toolbar item Label */
"Syntax Colours" = "Syntaksivärit";

/* Syntax definitions preferences toolbar item Label */
"Syntax Definitions" = "Syntaksin määrittely";

/* Indicate that the document %@ has been updated by another application in Document-has-been-updated-alert sheet */
"The document %@ has been updated by another application" = "Asiakirjaa “%@” on muutettu toisella sovelluksella";

/* Indicate in Close-sheet that the document %@ has not been saved. */
"The document %@ has not been saved" = "Asiakirjaa “%@” ei ole tallennettu";

/* Indicate that the document %@ is no longer open in Document-is-no-longer-opened-after-selection-in-advanced-find-sheet */
"The document %@ is no longer open" = "Asiakirja “%@” ei ole enää avoinna";

/* Indicate that the file %@ does not exist Open-file-does-not-exist sheet */
"The file %@ does not exist" = "Tiedostoa “%@” ei ole";

/* Indicate that there was a problem opening the document with the encoding %@. And ask if you want to open it anyway? */
"There was a problem opening the document with the encoding %@. Do you want to try to open it anyway?" = "Asiakirjan avaamisessa koodauksella %@ on ongelmia. Haluatko silti yrittää avata sen?";

/* Indicate that there was a unknown error when trying to install the command-linbe utility in Unknown-error-when-installing-comman-line-utility sheet */
"There was a unknown error when trying to install the command-line utility" = "Tuntematon virhe asennettaessa komentorivityökalua";

/* Indicate that there was a unknown error when trying to open the file %@ with authentication in Unknown-error-when-opening-with-authentication sheet */
"There was a unknown error when trying to open the file %@ with authentication" = "Tuntematon virhe yrittäessä avata tiedostoa %@ autentikoinnilla";

/* Indicate that there was a unknown error when trying to save the file %@ in Unknown-error-when-saving sheet */
"There was a unknown error when trying to save the file %@" = "Tuntematon virhe yrittäessä tallentaa tiedostoa “%@”";

/* Indicate that there was a unknown error when trying to save the file %@ with authentication in Unknown-error-when-saving-with-authentication sheet */
"There was a unknown error when trying to save the file %@ with authentication" = "Tuntematon virhe yrittäessä avata tiedostoa “%@” autentikoinnilla";

/* This message will NOT appear again so try to remember it:-) in Show Document In Full Screen */
"This message will NOT appear again so try to remember it:-)" = "Tämä viesti EI ilmesty uudelleen, joten yritä muistaa se :-)";

/* This will delete all snippets that exists in the collection %@. Are you sure you want to continue? when deleting a collection */
"This will delete all snippets that exists in the collection %@. Are you sure you want to continue?" = "Tämä poistaa kaikki pätkät, jotka esiintyvät kokoelmassa “%@”. Haluatko varmasti jatkaa?";

/* Unknown error when running the command in performCommand */
"Unknown error when running the command" = "Tuntematon virhe ajettaessa komentoa";

/* Name for untitled document */
"untitled" = "Nimetön";

/* Untitled project */
"Untitled project" = "Nimetön projekti";

/* Upload-button in Upload-preferences-to-iDisk sheet */
"Upload" = "Siirrä";

/* Use settings from Preferences in openAction */
"Use settings from Preferences" = "Käytä säätöjä Asetuksista";

/* Indicate that you can not save this file because %@ is now a folder */
"You can not save this file because %@ is now a folder" = "Et voi tallentaa tätä tiedostoa, koska “%@” on nyt kansio";

/* Indicate that you cannot open %@ because it is a folder in Open-file-is-a-directory sheet */
"You cannot open %@ because it is a folder" = "Et voi avata kohdetta “%@” koska se on kansio";

/* Indicate that you cannot revert this document because the file %@ doesn't exist anymore Revert-file-doesn't-exist sheet */
"You cannot revert this document because the file %@ doesn't exist anymore" = "et voi palauttaa tätä asiakirjaa, koska tiedostoa “%@” ei enää ole";

/* Indicate that they have set the preferences to not show anything in the status bar in Show-status-bar-action */
"You have set the preferences to not show anything in the status bar" = "Olet valinnut asetuksista olla näyttämättä mitään tilarivillä";

/* Your changes will be lost if you close the document without saving in Close-sheet */
"Your changes will be lost if you close the document without saving." = "Muutoksesi menetetään, jos suljet asiakirjan tallentamatta.";

/* Warn that changes will be lost if you revert in Revert-sheet */
"Your changes will be lost if you revert the document" = "Muutoksesi menetetään, jos palautat asiakirjan";

